blueskycoco/moto/src/tm4c123/moto.c
    /* get the values of all cSPIN registers and print them to the terminal I/O */
    cSPIN_Registers_Get(&cSPIN_RegsStruct);
#endif /* defined(DEBUG) */             
    
    /**********************************************************************/
    /* Start example of FLAG interrupt management */
    /**********************************************************************/
	UARTprintf("Start example of FLAG interrupt management\n");
    /* Clear Flag pin */
    cSPIN_rx_data = cSPIN_Get_Status();       
    /* Interrupt configuration for FLAG signal */
    //cSPIN_Flag_Interrupt_GPIO_Config();
    UARTprintf("Run constant speed of 400 steps/s forward direction\n");
    /* Run constant speed of 400 steps/s forward direction */
    cSPIN_Run(FWD, Speed_Steps_to_Par(400));
	UARTprintf("Tentative to write to the current motor absolute position register\n");
    /* Tentative to write to the current motor absolute position register */
    /* while the motor is running */
    cSPIN_Set_Param(cSPIN_ABS_POS, 100);
    cSPIN_Delay(0x004FFFFF);
	UARTprintf("Get Status to clear FLAG due to non-performable command\n");
    /* Get Status to clear FLAG due to non-performable command */
    cSPIN_rx_data = cSPIN_Get_Status();
    cSPIN_Delay(0x004FFFFF);        
	UARTprintf("Perform SoftStop commmand\n");
    /* Perform SoftStop commmand */
	cSPIN_Soft_Stop();
	UARTprintf("Wait until not busy - busy pin test\n");
    /* Wait until not busy - busy pin test */
	while(cSPIN_Busy_HW());
    cSPIN_Delay(0x004FFFFF);
    /**********************************************************************/
    /* End example of FLAG interrupt management */
    /**********************************************************************/
	UARTprintf("End example of FLAG interrupt management\n");
	UARTprintf("Start example of BUSY interrupt management\n");

    /**********************************************************************/
    /* Start example of BUSY interrupt management */
    /**********************************************************************/
    /* Interrupt configuration for BUSY signal */
    //cSPIN_Busy_Interrupt_GPIO_Config();
    UARTprintf("Move by 100,000 steps reverse, range 0 to 4,194,303\n");
	/* Move by 100,000 steps reverse, range 0 to 4,194,303 */
	cSPIN_Move(REV, (uint32_t)(100000));
    /* STEVAL_PCC009V2 : during busy time the POWER LED is switched OFF */
    /* ST_cSPIN_6480H_DISCOVERY : during busy time the LED_BUSY is switched ON */
    /* Wait until not busy - busy pin test */
	UARTprintf("during busy time the LED_BUSY is switched ON\n");
	while(cSPIN_Busy_HW());
    /* Disable the power bridges */
	cSPIN_Soft_HiZ();
    cSPIN_Delay(0x004FFFFF);
    /**********************************************************************/
    /* End example of BUSY interrupt management */
    /**********************************************************************/          
	UARTprintf("End example of BUSY interrupt management\n");
	UARTprintf("Move by 60,000 steps rorward, range 0 to 4,194,303\n");

	/* Move by 60,000 steps rorward, range 0 to 4,194,303 */
	cSPIN_Move(FWD, (uint32_t)(60000));
	UARTprintf("Move by 60,000 steps rorward, range 0 to 4,194,303\n");
	/* Wait until not busy - busy pin test */
	while(cSPIN_Busy_HW());
	UARTprintf("Send cSPIN command change hold duty cycle to 0.5% \n");
	/* Send cSPIN command change hold duty cycle to 0.5% */
	cSPIN_Set_Param(cSPIN_KVAL_HOLD, Kval_Perc_to_Par(0.5));
	UARTprintf("Send cSPIN command change run duty cycle to 5%\n");
	/* Send cSPIN command change run duty cycle to 5% */
	cSPIN_Set_Param(cSPIN_KVAL_RUN, Kval_Perc_to_Par(5));
	UARTprintf("Run constant speed of 50 steps/s reverse direction\n");
	/* Run constant speed of 50 steps/s reverse direction */
	cSPIN_Run(REV, Speed_Steps_to_Par(50));
	UARTprintf("Wait few seconds - motor turns\n");
	/* Wait few seconds - motor turns */
	cSPIN_Delay(0x004FFFFF);
	UARTprintf("Perform SoftStop commmand\n");
	/* Perform SoftStop commmand */
	cSPIN_Soft_Stop();
	UARTprintf("RESET KVAL_HOLD to initial value\n");
    /* RESET KVAL_HOLD to initial value */
	cSPIN_Set_Param(cSPIN_KVAL_HOLD, Kval_Perc_to_Par(cSPIN_CONF_PARAM_KVAL_HOLD));
	UARTprintf("RESET KVAL_RUN to initial value\n");
	/* RESET KVAL_RUN to initial value */
	cSPIN_Set_Param(cSPIN_KVAL_RUN, Kval_Perc_to_Par(cSPIN_CONF_PARAM_KVAL_RUN));
	UARTprintf("Wait until not busy - busy status check in Status register\n");
	/* Wait until not busy - busy status check in Status register */
	while(cSPIN_Busy_SW());
	UARTprintf("Move by 100,000 steps forward, range 0 to 4,194,303\n");
	/* Move by 100,000 steps forward, range 0 to 4,194,303 */
	cSPIN_Move(FWD, (uint32_t)(100000));
	UARTprintf("Wait until not busy\n");
	/* Wait until not busy */
	while(cSPIN_Busy_SW());
	UARTprintf("Wait a few seconds, LED busy is off\n");
    /* Wait a few seconds, LED busy is off */
    cSPIN_Delay(0x004FFFFF);
	UARTprintf("Test of the Flag pin by polling, wait in endless cycle if problem is detected\n");
	/* Test of the Flag pin by polling, wait in endless cycle if problem is detected */
	if(cSPIN_Flag()) while(1);
	UARTprintf("Issue cSPIN Go Home command\n");
	/* Issue cSPIN Go Home command */
	cSPIN_Go_Home();
	UARTprintf("Wait untill not busy - busy pin test\n");
	/* Wait untill not busy - busy pin test */
	while(cSPIN_Busy_HW());
	UARTprintf("Wait a few seconds, LED busy is off\n");
    /* Wait a few seconds, LED busy is off */
    cSPIN_Delay(0x004FFFFF);
	UARTprintf("Issue cSPIN Go To command\n");
	/* Issue cSPIN Go To command */
	cSPIN_Go_To(0x0000FFFF);
	UARTprintf(" Wait untill not busy - busy pin test\n");
	/* Wait untill not busy - busy pin test */
	while(cSPIN_Busy_HW());
	UARTprintf("Wait a few seconds, LED busy is off\n");
    /* Wait a few seconds, LED busy is off */
    cSPIN_Delay(0x004FFFFF);
	UARTprintf("Issue cSPIN Go To command\n");
	/* Issue cSPIN Go To command */
	cSPIN_Go_To_Dir(FWD, 0x0001FFFF);
	UARTprintf("Wait untill not busy - busy pin test\n");
	/* Wait untill not busy - busy pin test */
	while(cSPIN_Busy_HW());
	UARTprintf("Wait a few seconds, LED busy is off\n");
    /* Wait a few seconds, LED busy is off */
    cSPIN_Delay(0x004FFFFF);
	UARTprintf("Read run duty cycle (cSPIN_KVAL_RUN) parameter from cSPIN\n");
	/* Read run duty cycle (cSPIN_KVAL_RUN) parameter from cSPIN */
	cSPIN_rx_data = cSPIN_Get_Param(cSPIN_KVAL_RUN);
	UARTprintf("Read intersect speed (cSPIN_INT_SPD) parameter from cSPIN\n");
	/* Read intersect speed (cSPIN_INT_SPD) parameter from cSPIN */
	cSPIN_rx_data = cSPIN_Get_Param(cSPIN_INT_SPD);
	UARTprintf("Read Status register content\n");
	/* Read Status register content */
	cSPIN_rx_data = cSPIN_Get_Status();
	UARTprintf("Read absolute position (cSPIN_ABS_POS) parameter from cSPIN\n");
	/* Read absolute position (cSPIN_ABS_POS) parameter from cSPIN */
	cSPIN_rx_data = cSPIN_Get_Param(cSPIN_ABS_POS);
	UARTprintf("Reset position counter\n");
	/* Reset position counter */
	cSPIN_Reset_Pos();
	UARTprintf("Read absolute position (cSPIN_ABS_POS) parameter from cSPIN\n");
	/* Read absolute position (cSPIN_ABS_POS) parameter from cSPIN */
	cSPIN_rx_data = cSPIN_Get_Param(cSPIN_ABS_POS);
	UARTprintf("Issue cSPIN Hard HiZ command - disable power stage (High Impedance)\n");
	/* Issue cSPIN Hard HiZ command - disable power stage (High Impedance) */
	cSPIN_Hard_HiZ();
 	UARTprintf("Start example of GoUntil Command\n");
    /**********************************************************************/
    /* Start example of GoUntil Command */
    /**********************************************************************/
    /* Configure Interrupt for switch motor in case the MCU is used to pilot the switch */
    //cSPIN_Switch_Motor_Interrupt_Config();        
    /* Motion in FW direction at speed 400steps/s via GoUntil command*/
    /* When SW is closed:  */
    /*    As ACT is set to ACTION_COPY, ABS_POS is saved to MARK register */
    /*    then a soft stop is done          */
	UARTprintf("Motion in FW direction at speed 400steps/s via GoUntil command,When SW is closed:  As ACT is set to ACTION_COPY, ABS_POS is saved to MARK register\n");
	UARTprintf("then a soft stop is done\n");
    cSPIN_Go_Until(ACTION_COPY, FWD, Speed_Steps_to_Par(400));
    UARTprintf("Waiting for soft Stop after GoUntil command\n");
    /* Waiting for soft Stop after GoUntil command*/
    while(cSPIN_Busy_HW());
	UARTprintf("User action needed to go further\n");
    /* User action needed to go further */
    /* User attention drawn by toggling a LED */
    //  cSPIN_Gpio_Toggle(LED_SPARE_Port, LED_SPARE_Pin); 
    cSPIN_Delay(0x100000);
	UARTprintf("Wait a few seconds, LED busy is off\n");
    //GPIO_ResetBits(LED_SPARE_Port, LED_SPARE_Pin);
    /* Wait a few seconds, LED busy is off */
    cSPIN_Delay(0x004FFFFF);
  	UARTprintf("Move by 50,000 steps in reverse direction, range 0 to 4,194,303\n");
    /* Move by 50,000 steps in reverse direction, range 0 to 4,194,303 */
    cSPIN_Move(REV, (uint32_t)(50000));
     UARTprintf("Waiting for end of move command\n");  
        /* Waiting for end of move command*/
	while(cSPIN_Busy_HW());
    UARTprintf("Wait a few seconds, LED busy is off \n");    
    /* Wait a few seconds, LED busy is off */
    cSPIN_Delay(0x004FFFFF);
    UARTprintf("Go to Mark saved with GoUntil command \n");
    /* Go to Mark saved with GoUntil command */
    cSPIN_Go_Mark();
    UARTprintf("Wait until not busy - busy pin test\n");
    /* Wait until not busy - busy pin test */
	while(cSPIN_Busy_HW());
	UARTprintf("Wait a few seconds, LED busy is off\n");
    /* Wait a few seconds, LED busy is off */
    cSPIN_Delay(0x004FFFFF);
    UARTprintf("End example of GoUntil Command\n");
    /**********************************************************************/
    /* End example of GoUntil Command */
    /**********************************************************************/
	UARTprintf("End example of GoUntil Command\n");
    UARTprintf("Start example of ReleaseSw Command\n");
    /**********************************************************************/
    /* Start example of ReleaseSw Command */
    /**********************************************************************/
    /* Motion via cSPIN_Release_SW command in REV direction at minimum speed*/
    /* (or  5 steps/s is minimum speed is < 5step/s)*/
    /* When SW is opened :  */
    /*    As ACT is set to ACTION_RESET, ABS_POS is reset i.e Home position is set */
    /*    then a soft stop is done          */
	UARTprintf("Motion via cSPIN_Release_SW command in REV direction at minimum speed\n");
	UARTprintf("(or  5 steps/s is minimum speed is < 5step/s)\n");
	UARTprintf("When SW is opened : \n");
	UARTprintf("As ACT is set to ACTION_RESET, ABS_POS is reset i.e Home position is set\n");
	UARTprintf("then a soft stop is done      \n");
    cSPIN_Release_SW(ACTION_RESET, REV);
    
    /* Waiting for soft Stop after ReleaseSw command*/
    while(cSPIN_Busy_HW());
    /* User action needed to go further */
    /* User attention drawn by toggling a LED */
    //  cSPIN_Gpio_Toggle(LED_SPARE_Port, LED_SPARE_Pin); 
      cSPIN_Delay(0x100000);
	UARTprintf("\n");
    //GPIO_ResetBits(LED_SPARE_Port, LED_SPARE_Pin);
    UARTprintf("Wait a few seconds, LED busy is off\n");
    /* Wait a few seconds, LED busy is off */
    cSPIN_Delay(0x004FFFFF);
    UARTprintf("Move by 100,000 steps forward, range 0 to 4,194,303\n");
    /* Move by 100,000 steps forward, range 0 to 4,194,303 */
    cSPIN_Move(FWD, (uint32_t)(100000));
   UARTprintf("Waiting for end of move command\n");
    /* Waiting for end of move command*/
	while(cSPIN_Busy_HW());
    UARTprintf("Wait a few seconds, LED busy is off\n");    
    /* Wait a few seconds, LED busy is off */
    cSPIN_Delay(0x004FFFFF);        
    UARTprintf("Go to Home set with ReleaseSW command\n");
    /* Go to Home set with ReleaseSW command */
    cSPIN_Go_Home();
    UARTprintf("Wait until not busy - busy pin test\n");
   /* Wait until not busy - busy pin test */
	while(cSPIN_Busy_HW());
    UARTprintf("Wait a few seconds, LED busy is off\n");    
    /* Wait a few seconds, LED busy is off */
    cSPIN_Delay(0x004FFFFF);
    /**********************************************************************/
    /* End example of ReleaseSw Command */
    /**********************************************************************/
	UARTprintf("End example of ReleaseSw Command\n");

     /* Get Status to clear FLAG due to switch turn-on event (falling edge on SW pin) */
    cSPIN_rx_data = cSPIN_Get_Status();       
    UARTprintf("Start example of StepClock Command\n");
    /**********************************************************************/
    /* Start example of StepClock Command */
    /**********************************************************************/
    //cSPIN_Busy_Interrupt_GPIO_DeConfig();
    /* Enable Step Clock Mode */
    cSPIN_Step_Clock(FWD);
	UARTprintf("Wait a few seconds, LED busy is off\n");
    //cSPIN_Busy_Interrupt_GPIO_Config();
    /* Wait a few seconds, LED busy is off */
    cSPIN_Delay(0x004FFFFF);
    UARTprintf("Set PWM period to 500 so PWM Frequency = 1MHz/ 500 = 2KHz\n");
    /* Set PWM period to 500 so PWM Frequency = 1MHz/ 500 = 2KHz */
    /* and so, motor moves at 2000 steps/s */
    cSPIN_PWM_Enable(2000);
    cSPIN_Delay(0x00FFFFFF);
    cSPIN_PWM_DISABLE();
	UARTprintf("End example of StepClock Command\n");
    /**********************************************************************/
    /* End example of StepClock Command */
    /**********************************************************************/
    //
    // Loop forever echoing data through the UART.
    //
    while(1)
    {
    }
}
